## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # zentral_mdm_artifact.mscp-applicationaccess will be created
  + resource "zentral_mdm_artifact" "mscp-applicationaccess" {
      + auto_update                    = true
      + channel                        = "Device"
      + id                             = (known after apply)
      + install_during_setup_assistant = false
      + name                           = "mSCP - applicationaccess"
      + platforms                      = [
          + "macOS",
        ]
      + reinstall_interval             = 0
      + reinstall_on_os_update         = "No"
      + requires                       = (known after apply)
      + type                           = "Profile"
    }

  # zentral_mdm_artifact.mscp-assistant will be created
  + resource "zentral_mdm_artifact" "mscp-assistant" {
      + auto_update                    = true
      + channel                        = "Device"
      + id                             = (known after apply)
      + install_during_setup_assistant = false
      + name                           = "mSCP - assistant"
      + platforms                      = [
          + "macOS",
        ]
      + reinstall_interval             = 0
      + reinstall_on_os_update         = "No"
      + requires                       = (known after apply)
      + type                           = "Profile"
    }

  # zentral_mdm_artifact.mscp-icloud will be created
  + resource "zentral_mdm_artifact" "mscp-icloud" {
      + auto_update                    = true
      + channel                        = "Device"
      + id                             = (known after apply)
      + install_during_setup_assistant = false
      + name                           = "mSCP - icloud"
      + platforms                      = [
          + "macOS",
        ]
      + reinstall_interval             = 0
      + reinstall_on_os_update         = "No"
      + requires                       = (known after apply)
      + type                           = "Profile"
    }

  # zentral_mdm_blueprint_artifact.mscp-applicationaccess will be created
  + resource "zentral_mdm_blueprint_artifact" "mscp-applicationaccess" {
      + artifact_id        = (known after apply)
      + blueprint_id       = 1
      + default_shard      = 100
      + excluded_tag_ids   = []
      + id                 = (known after apply)
      + ios                = false
      + ios_max_version    = ""
      + ios_min_version    = ""
      + ipados             = false
      + ipados_max_version = ""
      + ipados_min_version = ""
      + macos              = true
      + macos_max_version  = ""
      + macos_min_version  = ""
      + shard_modulo       = 100
      + tag_shards         = []
      + tvos               = false
      + tvos_max_version   = ""
      + tvos_min_version   = ""
    }

  # zentral_mdm_blueprint_artifact.mscp-assistant will be created
  + resource "zentral_mdm_blueprint_artifact" "mscp-assistant" {
      + artifact_id        = (known after apply)
      + blueprint_id       = 1
      + default_shard      = 100
      + excluded_tag_ids   = []
      + id                 = (known after apply)
      + ios                = false
      + ios_max_version    = ""
      + ios_min_version    = ""
      + ipados             = false
      + ipados_max_version = ""
      + ipados_min_version = ""
      + macos              = true
      + macos_max_version  = ""
      + macos_min_version  = ""
      + shard_modulo       = 100
      + tag_shards         = []
      + tvos               = false
      + tvos_max_version   = ""
      + tvos_min_version   = ""
    }

  # zentral_mdm_blueprint_artifact.mscp-icloud will be created
  + resource "zentral_mdm_blueprint_artifact" "mscp-icloud" {
      + artifact_id        = (known after apply)
      + blueprint_id       = 1
      + default_shard      = 100
      + excluded_tag_ids   = []
      + id                 = (known after apply)
      + ios                = false
      + ios_max_version    = ""
      + ios_min_version    = ""
      + ipados             = false
      + ipados_max_version = ""
      + ipados_min_version = ""
      + macos              = true
      + macos_max_version  = ""
      + macos_min_version  = ""
      + shard_modulo       = 100
      + tag_shards         = []
      + tvos               = false
      + tvos_max_version   = ""
      + tvos_min_version   = ""
    }

  # zentral_mdm_filevault_config.default will be created
  + resource "zentral_mdm_filevault_config" "default" {
      + at_login_only                = true
      + bypass_attempts              = 0
      + destroy_key_on_standby       = true
      + escrow_location_display_name = "PSUMAC24 GitOps Workshop"
      + id                           = (known after apply)
      + name                         = "Default"
      + prk_rotation_interval_days   = 0
      + show_recovery_key            = false
    }

  # zentral_mdm_profile.mscp-applicationaccess-1 will be created
  + resource "zentral_mdm_profile" "mscp-applicationaccess-1" {
      + artifact_id        = (known after apply)
      + default_shard      = 100
      + excluded_tag_ids   = []
      + id                 = (known after apply)
      + ios                = false
      + ios_max_version    = ""
      + ios_min_version    = ""
      + ipados             = false
      + ipados_max_version = ""
      + ipados_min_version = ""
      + macos              = true
      + macos_max_version  = ""
      + macos_min_version  = ""
      + shard_modulo       = 100
      + source             = "PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiPz4KPCFET0NUWVBFIHBsaXN0IFBVQkxJQyAiLS8vQXBwbGUvL0RURCBQTElTVCAxLjAvL0VOIiAiaHR0cDovL3d3dy5hcHBsZS5jb20vRFREcy9Qcm9wZXJ0eUxpc3QtMS4wLmR0ZCI+CjxwbGlzdCB2ZXJzaW9uPSIxLjAiPgo8ZGljdD4KCTxrZXk+Q29uc2VudFRleHQ8L2tleT4KCTxkaWN0PgoJCTxrZXk+ZGVmYXVsdDwva2V5PgoJCTxzdHJpbmc+VEhFIFNPRlRXQVJFIElTIFBST1ZJREVEICdBUyBJUycgV0lUSE9VVCBBTlkgV0FSUkFOVFkgT0YgQU5ZIEtJTkQsIEVJVEhFUiBFWFBSRVNTRUQsIElNUExJRUQsIE9SIFNUQVRVVE9SWSwgSU5DTFVESU5HLCBCVVQgTk9UIExJTUlURUQgVE8sIEFOWSBXQVJSQU5UWSBUSEFUIFRIRSBTT0ZUV0FSRSBXSUxMIENPTkZPUk0gVE8gU1BFQ0lGSUNBVElPTlMsIEFOWSBJTVBMSUVEIFdBUlJBTlRJRVMgT0YgTUVSQ0hBTlRBQklMSVRZLCBGSVRORVNTIEZPUiBBIFBBUlRJQ1VMQVIgUFVSUE9TRSwgQU5EIEZSRUVET00gRlJPTSBJTkZSSU5HRU1FTlQsIEFORCBBTlkgV0FSUkFOVFkgVEhBVCBUSEUgRE9DVU1FTlRBVElPTiBXSUxMIENPTkZPUk0gVE8gVEhFIFNPRlRXQVJFLCBPUiBBTlkgV0FSUkFOVFkgVEhBVCBUSEUgU09GVFdBUkUgV0lMTCBCRSBFUlJPUiBGUkVFLiAgSU4gTk8gRVZFTlQgU0hBTEwgTklTVCBCRSBMSUFCTEUgRk9SIEFOWSBEQU1BR0VTLCBJTkNMVURJTkcsIEJVVCBOT1QgTElNSVRFRCBUTywgRElSRUNULCBJTkRJUkVDVCwgU1BFQ0lBTCBPUiBDT05TRVFVRU5USUFMIERBTUFHRVMsIEFSSVNJTkcgT1VUIE9GLCBSRVNVTFRJTkcgRlJPTSwgT1IgSU4gQU5ZIFdBWSBDT05ORUNURUQgV0lUSCBUSElTIFNPRlRXQVJFLCBXSEVUSEVSIE9SIE5PVCBCQVNFRCBVUE9OIFdBUlJBTlRZLCBDT05UUkFDVCwgVE9SVCwgT1IgT1RIRVJXSVNFLCBXSEVUSEVSIE9SIE5PVCBJTkpVUlkgV0FTIFNVU1RBSU5FRCBCWSBQRVJTT05TIE9SIFBST1BFUlRZIE9SIE9USEVSV0lTRSwgQU5EIFdIRVRIRVIgT1IgTk9UIExPU1MgV0FTIFNVU1RBSU5FRCBGUk9NLCBPUiBBUk9TRSBPVVQgT0YgVEhFIFJFU1VMVFMgT0YsIE9SIFVTRSBPRiwgVEhFIFNPRlRXQVJFIE9SIFNFUlZJQ0VTIFBST1ZJREVEIEhFUkVVTkRFUi48L3N0cmluZz4KCTwvZGljdD4KCTxrZXk+UGF5bG9hZENvbnRlbnQ8L2tleT4KCTxhcnJheT4KCQk8ZGljdD4KCQkJPGtleT5QYXlsb2FkSWRlbnRpZmllcjwva2V5PgoJCQk8c3RyaW5nPmFsYWNhcnRlLm1hY09TLjgwMC01M3I1X21vZGVyYXRlLjg3ODFhZjJiLWQ1YjctNGU2MS1hN2FjLWE1MjZkOGVkZWFlNTwvc3RyaW5nPgoJCQk8a2V5PlBheWxvYWRUeXBlPC9rZXk+CgkJCTxzdHJpbmc+Y29tLmFwcGxlLmFwcGxpY2F0aW9uYWNjZXNzPC9zdHJpbmc+CgkJCTxrZXk+UGF5bG9hZFVVSUQ8L2tleT4KCQkJPHN0cmluZz44NzgxYWYyYi1kNWI3LTRlNjEtYTdhYy1hNTI2ZDhlZGVhZTU8L3N0cmluZz4KCQkJPGtleT5QYXlsb2FkVmVyc2lvbjwva2V5PgoJCQk8aW50ZWdlcj4xPC9pbnRlZ2VyPgoJCQk8a2V5PmFsbG93QWNjb3VudE1vZGlmaWNhdGlvbjwva2V5PgoJCQk8ZmFsc2UvPgoJCQk8a2V5PmFsbG93QWN0aXZpdHlDb250aW51YXRpb248L2tleT4KCQkJPGZhbHNlLz4KCQkJPGtleT5hbGxvd0FpckRyb3A8L2tleT4KCQkJPGZhbHNlLz4KCQkJPGtleT5hbGxvd0FpclBsYXlJbmNvbWluZ1JlcXVlc3RzPC9rZXk+CgkJCTxmYWxzZS8+CgkJCTxrZXk+YWxsb3dBcHBsZVBlcnNvbmFsaXplZEFkdmVydGlzaW5nPC9rZXk+CgkJCTxmYWxzZS8+CgkJCTxrZXk+YWxsb3dBc3Npc3RhbnQ8L2tleT4KCQkJPGZhbHNlLz4KCQkJPGtleT5hbGxvd0F1dG9VbmxvY2s8L2tleT4KCQkJPGZhbHNlLz4KCQkJPGtleT5hbGxvd0Nsb3VkQWRkcmVzc0Jvb2s8L2tleT4KCQkJPGZhbHNlLz4KCQkJPGtleT5hbGxvd0Nsb3VkQm9va21hcmtzPC9rZXk+CgkJCTxmYWxzZS8+CgkJCTxrZXk+YWxsb3dDbG91ZENhbGVuZGFyPC9rZXk+CgkJCTxmYWxzZS8+CgkJCTxrZXk+YWxsb3dDbG91ZERlc2t0b3BBbmREb2N1bWVudHM8L2tleT4KCQkJPGZhbHNlLz4KCQkJPGtleT5hbGxvd0Nsb3VkRG9jdW1lbnRTeW5jPC9rZXk+CgkJCTxmYWxzZS8+CgkJCTxrZXk+YWxsb3dDbG91ZEZyZWVmb3JtPC9rZXk+CgkJCTxmYWxzZS8+CgkJCTxrZXk+YWxsb3dDbG91ZEtleWNoYWluU3luYzwva2V5PgoJCQk8ZmFsc2UvPgoJCQk8a2V5PmFsbG93Q2xvdWRNYWlsPC9rZXk+CgkJCTxmYWxzZS8+CgkJCTxrZXk+YWxsb3dDbG91ZE5vdGVzPC9rZXk+CgkJCTxmYWxzZS8+CgkJCTxrZXk+YWxsb3dDbG91ZFBob3RvTGlicmFyeTwva2V5PgoJCQk8ZmFsc2UvPgoJCQk8a2V5PmFsbG93Q2xvdWRQcml2YXRlUmVsYXk8L2tleT4KCQkJPGZhbHNlLz4KCQkJPGtleT5hbGxvd0Nsb3VkUmVtaW5kZXJzPC9rZXk+CgkJCTxmYWxzZS8+CgkJCTxrZXk+YWxsb3dDb250ZW50Q2FjaGluZzwva2V5PgoJCQk8ZmFsc2UvPgoJCQk8a2V5PmFsbG93RGlhZ25vc3RpY1N1Ym1pc3Npb248L2tleT4KCQkJPGZhbHNlLz4KCQkJPGtleT5hbGxvd0RpY3RhdGlvbjwva2V5PgoJCQk8ZmFsc2UvPgoJCQk8a2V5PmFsbG93RmluZE15RGV2aWNlPC9rZXk+CgkJCTxmYWxzZS8+CgkJCTxrZXk+YWxsb3dGaW5kTXlGcmllbmRzPC9rZXk+CgkJCTxmYWxzZS8+CgkJCTxrZXk+YWxsb3dGaW5nZXJwcmludEZvclVubG9jazwva2V5PgoJCQk8ZmFsc2UvPgoJCQk8a2V5PmFsbG93R2FtZUNlbnRlcjwva2V5PgoJCQk8ZmFsc2UvPgoJCQk8a2V5PmFsbG93UGFzc3dvcmRBdXRvRmlsbDwva2V5PgoJCQk8ZmFsc2UvPgoJCQk8a2V5PmFsbG93UGFzc3dvcmRQcm94aW1pdHlSZXF1ZXN0czwva2V5PgoJCQk8ZmFsc2UvPgoJCQk8a2V5PmFsbG93UGFzc3dvcmRTaGFyaW5nPC9rZXk+CgkJCTxmYWxzZS8+CgkJCTxrZXk+YWxsb3dSYXBpZFNlY3VyaXR5UmVzcG9uc2VJbnN0YWxsYXRpb248L2tleT4KCQkJPHRydWUvPgoJCQk8a2V5PmFsbG93UmFwaWRTZWN1cml0eVJlc3BvbnNlUmVtb3ZhbDwva2V5PgoJCQk8ZmFsc2UvPgoJCQk8a2V5PmFsbG93VUlDb25maWd1cmF0aW9uUHJvZmlsZUluc3RhbGxhdGlvbjwva2V5PgoJCQk8ZmFsc2UvPgoJCQk8a2V5PmFsbG93VVNCUmVzdHJpY3RlZE1vZGU8L2tleT4KCQkJPHRydWUvPgoJCQk8a2V5PmZvcmNlT25EZXZpY2VPbmx5RGljdGF0aW9uPC9rZXk+CgkJCTx0cnVlLz4KCQk8L2RpY3Q+Cgk8L2FycmF5PgoJPGtleT5QYXlsb2FkRGVzY3JpcHRpb248L2tleT4KCTxzdHJpbmc+Q3JlYXRlZDogMjAyNC0wNy0wOQpDb25maWd1cmF0aW9uIHNldHRpbmdzIGZvciB0aGUgY29tLmFwcGxlLmFwcGxpY2F0aW9uYWNjZXNzIHByZWZlcmVuY2UgZG9tYWluLjwvc3RyaW5nPgoJPGtleT5QYXlsb2FkRGlzcGxheU5hbWU8L2tleT4KCTxzdHJpbmc+WzgwMC01M3I1X21vZGVyYXRlXSBjb20uYXBwbGUuYXBwbGljYXRpb25hY2Nlc3Mgc2V0dGluZ3M8L3N0cmluZz4KCTxrZXk+UGF5bG9hZElkZW50aWZpZXI8L2tleT4KCTxzdHJpbmc+Y29tLmFwcGxlLmFwcGxpY2F0aW9uYWNjZXNzLjgwMC01M3I1X21vZGVyYXRlPC9zdHJpbmc+Cgk8a2V5PlBheWxvYWRPcmdhbml6YXRpb248L2tleT4KCTxzdHJpbmc+bWFjT1MgU2VjdXJpdHkgQ29tcGxpYW5jZSBQcm9qZWN0PC9zdHJpbmc+Cgk8a2V5PlBheWxvYWRTY29wZTwva2V5PgoJPHN0cmluZz5TeXN0ZW08L3N0cmluZz4KCTxrZXk+UGF5bG9hZFR5cGU8L2tleT4KCTxzdHJpbmc+Q29uZmlndXJhdGlvbjwvc3RyaW5nPgoJPGtleT5QYXlsb2FkVVVJRDwva2V5PgoJPHN0cmluZz4xMWE3NGM4NS02ZDkzLTQwNmItOWRmMS03OTg4Zjc3OWFiZWE8L3N0cmluZz4KCTxrZXk+UGF5bG9hZFZlcnNpb248L2tleT4KCTxpbnRlZ2VyPjE8L2ludGVnZXI+CjwvZGljdD4KPC9wbGlzdD4K"
      + tag_shards         = []
      + tvos               = false
      + tvos_max_version   = ""
      + tvos_min_version   = ""
      + version            = 1
    }

  # zentral_mdm_profile.mscp-assistant-1 will be created
  + resource "zentral_mdm_profile" "mscp-assistant-1" {
      + artifact_id        = (known after apply)
      + default_shard      = 100
      + excluded_tag_ids   = []
      + id                 = (known after apply)
      + ios                = false
      + ios_max_version    = ""
      + ios_min_version    = ""
      + ipados             = false
      + ipados_max_version = ""
      + ipados_min_version = ""
      + macos              = true
      + macos_max_version  = ""
      + macos_min_version  = ""
      + shard_modulo       = 100
      + source             = "PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiPz4KPCFET0NUWVBFIHBsaXN0IFBVQkxJQyAiLS8vQXBwbGUvL0RURCBQTElTVCAxLjAvL0VOIiAiaHR0cDovL3d3dy5hcHBsZS5jb20vRFREcy9Qcm9wZXJ0eUxpc3QtMS4wLmR0ZCI+CjxwbGlzdCB2ZXJzaW9uPSIxLjAiPgo8ZGljdD4KCTxrZXk+Q29uc2VudFRleHQ8L2tleT4KCTxkaWN0PgoJCTxrZXk+ZGVmYXVsdDwva2V5PgoJCTxzdHJpbmc+VEhFIFNPRlRXQVJFIElTIFBST1ZJREVEICdBUyBJUycgV0lUSE9VVCBBTlkgV0FSUkFOVFkgT0YgQU5ZIEtJTkQsIEVJVEhFUiBFWFBSRVNTRUQsIElNUExJRUQsIE9SIFNUQVRVVE9SWSwgSU5DTFVESU5HLCBCVVQgTk9UIExJTUlURUQgVE8sIEFOWSBXQVJSQU5UWSBUSEFUIFRIRSBTT0ZUV0FSRSBXSUxMIENPTkZPUk0gVE8gU1BFQ0lGSUNBVElPTlMsIEFOWSBJTVBMSUVEIFdBUlJBTlRJRVMgT0YgTUVSQ0hBTlRBQklMSVRZLCBGSVRORVNTIEZPUiBBIFBBUlRJQ1VMQVIgUFVSUE9TRSwgQU5EIEZSRUVET00gRlJPTSBJTkZSSU5HRU1FTlQsIEFORCBBTlkgV0FSUkFOVFkgVEhBVCBUSEUgRE9DVU1FTlRBVElPTiBXSUxMIENPTkZPUk0gVE8gVEhFIFNPRlRXQVJFLCBPUiBBTlkgV0FSUkFOVFkgVEhBVCBUSEUgU09GVFdBUkUgV0lMTCBCRSBFUlJPUiBGUkVFLiAgSU4gTk8gRVZFTlQgU0hBTEwgTklTVCBCRSBMSUFCTEUgRk9SIEFOWSBEQU1BR0VTLCBJTkNMVURJTkcsIEJVVCBOT1QgTElNSVRFRCBUTywgRElSRUNULCBJTkRJUkVDVCwgU1BFQ0lBTCBPUiBDT05TRVFVRU5USUFMIERBTUFHRVMsIEFSSVNJTkcgT1VUIE9GLCBSRVNVTFRJTkcgRlJPTSwgT1IgSU4gQU5ZIFdBWSBDT05ORUNURUQgV0lUSCBUSElTIFNPRlRXQVJFLCBXSEVUSEVSIE9SIE5PVCBCQVNFRCBVUE9OIFdBUlJBTlRZLCBDT05UUkFDVCwgVE9SVCwgT1IgT1RIRVJXSVNFLCBXSEVUSEVSIE9SIE5PVCBJTkpVUlkgV0FTIFNVU1RBSU5FRCBCWSBQRVJTT05TIE9SIFBST1BFUlRZIE9SIE9USEVSV0lTRSwgQU5EIFdIRVRIRVIgT1IgTk9UIExPU1MgV0FTIFNVU1RBSU5FRCBGUk9NLCBPUiBBUk9TRSBPVVQgT0YgVEhFIFJFU1VMVFMgT0YsIE9SIFVTRSBPRiwgVEhFIFNPRlRXQVJFIE9SIFNFUlZJQ0VTIFBST1ZJREVEIEhFUkVVTkRFUi48L3N0cmluZz4KCTwvZGljdD4KCTxrZXk+UGF5bG9hZENvbnRlbnQ8L2tleT4KCTxhcnJheT4KCQk8ZGljdD4KCQkJPGtleT5QYXlsb2FkSWRlbnRpZmllcjwva2V5PgoJCQk8c3RyaW5nPmFsYWNhcnRlLm1hY09TLjgwMC01M3I1X21vZGVyYXRlLmE5MmEyNTM0LWFjZTktNGM5Yi1hYmUyLTMwNmQxYWE5YmJiNTwvc3RyaW5nPgoJCQk8a2V5PlBheWxvYWRUeXBlPC9rZXk+CgkJCTxzdHJpbmc+Y29tLmFwcGxlLmFzc2lzdGFudC5zdXBwb3J0PC9zdHJpbmc+CgkJCTxrZXk+UGF5bG9hZFVVSUQ8L2tleT4KCQkJPHN0cmluZz5hOTJhMjUzNC1hY2U5LTRjOWItYWJlMi0zMDZkMWFhOWJiYjU8L3N0cmluZz4KCQkJPGtleT5QYXlsb2FkVmVyc2lvbjwva2V5PgoJCQk8aW50ZWdlcj4xPC9pbnRlZ2VyPgoJCQk8a2V5PlNpcmkgRGF0YSBTaGFyaW5nIE9wdC1JbiBTdGF0dXM8L2tleT4KCQkJPGludGVnZXI+MjwvaW50ZWdlcj4KCQk8L2RpY3Q+Cgk8L2FycmF5PgoJPGtleT5QYXlsb2FkRGVzY3JpcHRpb248L2tleT4KCTxzdHJpbmc+Q3JlYXRlZDogMjAyNC0wNy0wOQpDb25maWd1cmF0aW9uIHNldHRpbmdzIGZvciB0aGUgY29tLmFwcGxlLmFzc2lzdGFudC5zdXBwb3J0IHByZWZlcmVuY2UgZG9tYWluLjwvc3RyaW5nPgoJPGtleT5QYXlsb2FkRGlzcGxheU5hbWU8L2tleT4KCTxzdHJpbmc+WzgwMC01M3I1X21vZGVyYXRlXSBjb20uYXBwbGUuYXNzaXN0YW50LnN1cHBvcnQgc2V0dGluZ3M8L3N0cmluZz4KCTxrZXk+UGF5bG9hZElkZW50aWZpZXI8L2tleT4KCTxzdHJpbmc+Y29tLmFwcGxlLmFzc2lzdGFudC5zdXBwb3J0LjgwMC01M3I1X21vZGVyYXRlPC9zdHJpbmc+Cgk8a2V5PlBheWxvYWRPcmdhbml6YXRpb248L2tleT4KCTxzdHJpbmc+bWFjT1MgU2VjdXJpdHkgQ29tcGxpYW5jZSBQcm9qZWN0PC9zdHJpbmc+Cgk8a2V5PlBheWxvYWRTY29wZTwva2V5PgoJPHN0cmluZz5TeXN0ZW08L3N0cmluZz4KCTxrZXk+UGF5bG9hZFR5cGU8L2tleT4KCTxzdHJpbmc+Q29uZmlndXJhdGlvbjwvc3RyaW5nPgoJPGtleT5QYXlsb2FkVVVJRDwva2V5PgoJPHN0cmluZz5hYWQ5Y2RkYy00MmRiLTQ0MTYtYTg0ZC1kZTMzZmE0NGY2YTQ8L3N0cmluZz4KCTxrZXk+UGF5bG9hZFZlcnNpb248L2tleT4KCTxpbnRlZ2VyPjE8L2ludGVnZXI+CjwvZGljdD4KPC9wbGlzdD4K"
      + tag_shards         = []
      + tvos               = false
      + tvos_max_version   = ""
      + tvos_min_version   = ""
      + version            = 1
    }

  # zentral_mdm_profile.mscp-icloud-1 will be created
  + resource "zentral_mdm_profile" "mscp-icloud-1" {
      + artifact_id        = (known after apply)
      + default_shard      = 100
      + excluded_tag_ids   = []
      + id                 = (known after apply)
      + ios                = false
      + ios_max_version    = ""
      + ios_min_version    = ""
      + ipados             = false
      + ipados_max_version = ""
      + ipados_min_version = ""
      + macos              = true
      + macos_max_version  = ""
      + macos_min_version  = ""
      + shard_modulo       = 100
      + source             = "PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiPz4KPCFET0NUWVBFIHBsaXN0IFBVQkxJQyAiLS8vQXBwbGUvL0RURCBQTElTVCAxLjAvL0VOIiAiaHR0cDovL3d3dy5hcHBsZS5jb20vRFREcy9Qcm9wZXJ0eUxpc3QtMS4wLmR0ZCI+CjxwbGlzdCB2ZXJzaW9uPSIxLjAiPgo8ZGljdD4KCTxrZXk+Q29uc2VudFRleHQ8L2tleT4KCTxkaWN0PgoJCTxrZXk+ZGVmYXVsdDwva2V5PgoJCTxzdHJpbmc+VEhFIFNPRlRXQVJFIElTIFBST1ZJREVEICdBUyBJUycgV0lUSE9VVCBBTlkgV0FSUkFOVFkgT0YgQU5ZIEtJTkQsIEVJVEhFUiBFWFBSRVNTRUQsIElNUExJRUQsIE9SIFNUQVRVVE9SWSwgSU5DTFVESU5HLCBCVVQgTk9UIExJTUlURUQgVE8sIEFOWSBXQVJSQU5UWSBUSEFUIFRIRSBTT0ZUV0FSRSBXSUxMIENPTkZPUk0gVE8gU1BFQ0lGSUNBVElPTlMsIEFOWSBJTVBMSUVEIFdBUlJBTlRJRVMgT0YgTUVSQ0hBTlRBQklMSVRZLCBGSVRORVNTIEZPUiBBIFBBUlRJQ1VMQVIgUFVSUE9TRSwgQU5EIEZSRUVET00gRlJPTSBJTkZSSU5HRU1FTlQsIEFORCBBTlkgV0FSUkFOVFkgVEhBVCBUSEUgRE9DVU1FTlRBVElPTiBXSUxMIENPTkZPUk0gVE8gVEhFIFNPRlRXQVJFLCBPUiBBTlkgV0FSUkFOVFkgVEhBVCBUSEUgU09GVFdBUkUgV0lMTCBCRSBFUlJPUiBGUkVFLiAgSU4gTk8gRVZFTlQgU0hBTEwgTklTVCBCRSBMSUFCTEUgRk9SIEFOWSBEQU1BR0VTLCBJTkNMVURJTkcsIEJVVCBOT1QgTElNSVRFRCBUTywgRElSRUNULCBJTkRJUkVDVCwgU1BFQ0lBTCBPUiBDT05TRVFVRU5USUFMIERBTUFHRVMsIEFSSVNJTkcgT1VUIE9GLCBSRVNVTFRJTkcgRlJPTSwgT1IgSU4gQU5ZIFdBWSBDT05ORUNURUQgV0lUSCBUSElTIFNPRlRXQVJFLCBXSEVUSEVSIE9SIE5PVCBCQVNFRCBVUE9OIFdBUlJBTlRZLCBDT05UUkFDVCwgVE9SVCwgT1IgT1RIRVJXSVNFLCBXSEVUSEVSIE9SIE5PVCBJTkpVUlkgV0FTIFNVU1RBSU5FRCBCWSBQRVJTT05TIE9SIFBST1BFUlRZIE9SIE9USEVSV0lTRSwgQU5EIFdIRVRIRVIgT1IgTk9UIExPU1MgV0FTIFNVU1RBSU5FRCBGUk9NLCBPUiBBUk9TRSBPVVQgT0YgVEhFIFJFU1VMVFMgT0YsIE9SIFVTRSBPRiwgVEhFIFNPRlRXQVJFIE9SIFNFUlZJQ0VTIFBST1ZJREVEIEhFUkVVTkRFUi48L3N0cmluZz4KCTwvZGljdD4KCTxrZXk+UGF5bG9hZENvbnRlbnQ8L2tleT4KCTxhcnJheT4KCQk8ZGljdD4KCQkJPGtleT5EaXNhYmxlRk1NaUNsb3VkU2V0dGluZzwva2V5PgoJCQk8dHJ1ZS8+CgkJCTxrZXk+UGF5bG9hZElkZW50aWZpZXI8L2tleT4KCQkJPHN0cmluZz5hbGFjYXJ0ZS5tYWNPUy44MDAtNTNyNV9tb2RlcmF0ZS4xYmNkNzYyOS1kNjIxLTQ2ZWQtODRmNC0wMWU0MzFkZDFhYzA8L3N0cmluZz4KCQkJPGtleT5QYXlsb2FkVHlwZTwva2V5PgoJCQk8c3RyaW5nPmNvbS5hcHBsZS5pY2xvdWQubWFuYWdlZDwvc3RyaW5nPgoJCQk8a2V5PlBheWxvYWRVVUlEPC9rZXk+CgkJCTxzdHJpbmc+MWJjZDc2MjktZDYyMS00NmVkLTg0ZjQtMDFlNDMxZGQxYWMwPC9zdHJpbmc+CgkJCTxrZXk+UGF5bG9hZFZlcnNpb248L2tleT4KCQkJPGludGVnZXI+MTwvaW50ZWdlcj4KCQk8L2RpY3Q+Cgk8L2FycmF5PgoJPGtleT5QYXlsb2FkRGVzY3JpcHRpb248L2tleT4KCTxzdHJpbmc+Q3JlYXRlZDogMjAyNC0wNy0wOQpDb25maWd1cmF0aW9uIHNldHRpbmdzIGZvciB0aGUgY29tLmFwcGxlLmljbG91ZC5tYW5hZ2VkIHByZWZlcmVuY2UgZG9tYWluLjwvc3RyaW5nPgoJPGtleT5QYXlsb2FkRGlzcGxheU5hbWU8L2tleT4KCTxzdHJpbmc+WzgwMC01M3I1X21vZGVyYXRlXSBjb20uYXBwbGUuaWNsb3VkLm1hbmFnZWQgc2V0dGluZ3M8L3N0cmluZz4KCTxrZXk+UGF5bG9hZElkZW50aWZpZXI8L2tleT4KCTxzdHJpbmc+Y29tLmFwcGxlLmljbG91ZC5tYW5hZ2VkLjgwMC01M3I1X21vZGVyYXRlPC9zdHJpbmc+Cgk8a2V5PlBheWxvYWRPcmdhbml6YXRpb248L2tleT4KCTxzdHJpbmc+bWFjT1MgU2VjdXJpdHkgQ29tcGxpYW5jZSBQcm9qZWN0PC9zdHJpbmc+Cgk8a2V5PlBheWxvYWRTY29wZTwva2V5PgoJPHN0cmluZz5TeXN0ZW08L3N0cmluZz4KCTxrZXk+UGF5bG9hZFR5cGU8L2tleT4KCTxzdHJpbmc+Q29uZmlndXJhdGlvbjwvc3RyaW5nPgoJPGtleT5QYXlsb2FkVVVJRDwva2V5PgoJPHN0cmluZz5kNWQ1ZmMzZS1kODdlLTQ1M2YtYjBkYi1iNTcyMjA1Zjc0NjQ8L3N0cmluZz4KCTxrZXk+UGF5bG9hZFZlcnNpb248L2tleT4KCTxpbnRlZ2VyPjE8L2ludGVnZXI+CjwvZGljdD4KPC9wbGlzdD4K"
      + tag_shards         = []
      + tvos               = false
      + tvos_max_version   = ""
      + tvos_min_version   = ""
      + version            = 1
    }

Plan: 10 to add, 0 to change, 0 to destroy.
```
</details>